<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2
import requests
from bs4 import BeautifulSoup

In [2]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME='project_sql'
USER='skillfactory'
HOST='84.201.134.129'
PASSWORD='cCkxxLVrDE8EbvjueeMedPKt'
PORT=5432

In [3]:
connection = psycopg2.connect(
   dbname=DBNAME,
   user=USER,
   host=HOST,
   password=PASSWORD,
   port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
query_3_1 = f'''select count(v.id)
            from public.vacancies v
'''

In [5]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
# текст запроса
query_3_2 = f'''select count(e.id)
            from public.employers e
'''

In [7]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
# текст запроса
query_3_3 = f'''select count(a.id)
            from public.areas a
'''

In [9]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\928149064.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
# текст запроса
query_3_4 = f'''select count(i.id)
            from public.industries i
'''

In [11]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

In [12]:
# выводы по предварительному анализу данных
# В результате первичного анализа можно сделать вывод, что у нас имеется объемная база данных.
#В которой почти 50000 вакансий и более 23000 работодателей почти из 300 сфер деятельности.
#Также у нас обширная география вакансий, которая включает почти 1400 регионов.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
# текст запроса
query_4_1 = f'''
select a.name area,
count(v.id) cnt
from public.vacancies v
left join public.areas a on v.area_id=a.id
group by area
order by cnt desc
limit 5
'''

In [14]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [15]:
# текст запроса
query_4_2 = f'''
select count(v.id)
from public.vacancies v
WHERE (v.salary_from is not null or v.salary_to is not null)
'''

In [16]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\970655580.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [17]:
# текст запроса
query_4_3 = f'''
select round(avg(v.salary_from)) salary_from,
round(avg(v.salary_to)) salary_to
from public.vacancies v
'''

In [18]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

   salary_from  salary_to
0      71065.0   110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [19]:
# текст запроса
query_4_4 = f'''
select v.schedule,
v.employment,
count(v.id)
from public.vacancies v
group by 1, 2 
order by 3 desc
'''

In [20]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\2022935265.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [21]:
# текст запроса
query_4_5 = f'''
select v.experience
from public.vacancies v
group by v.experience
order by count(v.id)
'''

In [22]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience
0         Более 6 лет
1           Нет опыта
2       От 3 до 6 лет
3  От 1 года до 3 лет

***

In [23]:
# выводы по детальному анализу вакансий
#После более детального анализа вакансий можно сделать следующие выводы:
#Топ 5 городов по количеству вакансий: Москва, Санк-Петербург, Минск, Новосибирск, Алматы. 
#Где Москва более чем в два раза лидирует по количеству вакансий, у остальных же городов между собой не такой большой разрыв.
#Примерно в половине всех вакансий указана нижняя или верхняя граница з/п.
#Среднее значение нижней границы з/п около 71 тыс. руб, а верхней граница около 110 тыс. руб.
#Порядка 70% вакансий ищут людей на работу в офисе на полную занятость. Примерно 15% готовы предложить удаленную работу с полной занятостью.
#В большинстве вакансий необходим минимальный опыт работы от 1 года. Более 6 лет стажа  требуется на малое количество вакансий.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [24]:
query_5_1 = f'''
(select e.name,
count(v.id)
from public.vacancies v
left join public.employers e on v.employer_id = e.id
group by 1
order by 2 desc
limit 1)
union all
(select e.name,
count(v.id)
from public.vacancies v
left join public.employers e on v.employer_id = e.id
group by 1
order by 2 desc
offset 4
limit 1)
'''

In [25]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\3834399874.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

            name  count
0         Яндекс   1933
1  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [26]:
# текст запроса
query_5_2 = f'''
select a.name,
	count(distinct e.id) employers, 
	count(distinct v.id) vacancies
from public.areas a 
	left join public.employers e on e.area = a.id
    left join public.vacancies v on v.area_id=a.id
where v.id is null
group by 1 
order by 3 asc, 2 desc
'''

In [27]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\2250345976.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                               name  employers  vacancies
0                            Россия        410          0
1                         Казахстан        207          0
2                Московская область         75          0
3                Краснодарский край         19          0
4                          Беларусь         18          0
..                              ...        ...        ...
588                        Кувандык          0          0
589                        Куйбышев          0          0
590  Куйбышево (Ростовская область)          0          0
591                        Култаево          0          0
592                        Кульсары          0          0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [28]:
# текст запроса
query_5_3 = f'''
select distinct e.name,
count(distinct v.area_id) cnt
from public.vacancies v
left join public.employers e on e.id=v.employer_id
group by e.id
order by cnt desc
'''

In [29]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                          name  cnt
0                       Яндекс  181
1                   Ростелеком  152
2                   Спецремонт  116
3       Поляков Денис Иванович   88
4                    ООО ЕФИН    71
...                        ...  ...
14799     Яроцкий Е. В./ MoonX    1
14800  Ясли-сад №374 г. Минска    1
14801                      ЯСП    1
14802        Ястро-Переработка    1
14803                     ЯТСС    1

[14804 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [30]:
# текст запроса
query_5_4 = f'''
select count(e.name)
FROM public.EMPLOYERS e
LEFT JOIN public.EMPLOYERS_INDUSTRIES ei on employer_id = e.id
where ei.industry_id is null 
'''

In [31]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\3493105328.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [32]:
# текст запроса
query_5_5 = f'''
select e.name
from public.EMPLOYERS e
left join public.EMPLOYERS_INDUSTRIES ei on employer_id = e.id
group by 1
having count(ei.employer_id)=4
order by 1
offset 2 
limit 1      
'''

In [33]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [34]:
# текст запроса
query_5_6 = f'''
select i.name, 
count(*)
from public.employers_industries ei
left join public.employers e on e.id = ei.employer_id
left join public.industries i on i.id = ei.industry_id
group by 1
having i.name = 'Разработка программного обеспечения'    
'''

In [35]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\821628714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

                                  name  count
0  Разработка программного обеспечения   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [36]:
# код для получения списка городов-милионников
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
cities_wiki = list(pd.read_html(url)[1]['Город'])
cities = []
for city in cities_wiki:
    cities.append(city.replace('[a]', ''))
cities = tuple(cities)
print(cities)

('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград')

In [37]:
# текст запроса
query_5_7 = f'''
(select
    a.name,
    count(v.id) cnt
from public.vacancies v
join public.employers e on 
    e.id = v.employer_id
    and
    e.name = 'Яндекс'
join public.areas a on
    a.id = v.area_id
    and
    a.name in {cities}
group by a.name
union all
select
    'Total',
    count(*)
from public.vacancies v
join public.employers e on
    e.id = v.employer_id
    and
    e.name = 'Яндекс'
join public.areas a on
    a.id = v.area_id
    and
    a.name in {cities})
order by 2 desc
'''

In [38]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\1965596796.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name  cnt
0             Total  485
1            Москва   54
2   Санкт-Петербург   42
3      Екатеринбург   39
4   Нижний Новгород   36
5       Новосибирск   35
6           Воронеж   32
7         Краснодар   30
8            Самара   26
9               Уфа   26
10            Пермь   25
11           Казань   25
12   Ростов-на-Дону   25
13        Волгоград   24
14       Красноярск   23
15        Челябинск   22
16             Омск   21

***

In [39]:
# выводы по анализу работодателей
#В результате анализа работодателей можно сделать следующие выводы:
#В нашей БД есть работодатели не только из России и стран СНГ, но даже из Сингапура.
#Естественно Москва лидирует по количеству работодателей, почти в 3 раза меньше работодателей в Санкт-петербурге,
#а на 3 и 4 местах расположились с существенным отстованием самые крупные города Белорисии и Казахстана соответственно, опередев другие города миллионники России.
#С отрывом в 4 раза от 2 места по количеству вакансий в БД лидирует Яндекс. Дальше по количеству вакансий ожидаемо расположились крупнейшие Российские компании,
#такие как: Ростелеком, Тинькофф, СБЕР, Газпром нефть и другие.
#Яндекс, Ростелеком и Спецремонт осуществляют поиск специалистов в более чем 100 регионах. Яндекс ищет работников на удаленку, в то время как Ростелеком и Спецремонт
#ищут сотрудников из разных регионов, так как это компании, которые физически осуществляют обслуживание и строительство по всей стране.
#Разработкой программного обеспечения занимаются >15% работодателей. При этом примерно 30% работодателей не указали свою сферу деятельности.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [40]:
# текст запроса
query_6_1 = f'''
select
    count(v.name)
from public.vacancies v
where lower(v.name) like '%data%' or lower(v.name) like '%данн%'   
'''

In [41]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\366702258.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [42]:
# текст запроса
search_ds_vac = '{%data scientist%, %data science%, %исследователь данных%, %machine learning%, %машинн%обучен%}'
query_6_2 = f'''
select
    count(id)
from public.vacancies
where  (name   ilike any ( '{search_ds_vac}')
or (name not like '%HTML%' and name like '%ML%')) 
and ((name ilike '%junior%') or (experience='Нет опыта') or (schedule='Стажировка'))
'''

In [43]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\2267038862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [44]:
# текст запроса
query_6_3 = f'''
select
    count(id)
from public.vacancies
where  (name   ilike any ( '{search_ds_vac}')
or (name not like '%HTML%' and name like '%ML%')) 
and ((key_skills ilike '%SQL%') or (key_skills ilike '%postgres%'))
'''

In [45]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\3794299702.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [46]:
# текст запроса
query_6_4 = f'''
select
    count(id)
from public.vacancies
where  (name   ilike any ( '{search_ds_vac}')
or (name not like '%HTML%' and name like '%ML%')) 
and key_skills ilike '%Python%'
'''

In [47]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\4264665179.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [48]:
# текст запроса
query_6_5 = f'''
select
    round(avg(length(key_skills) - length(replace(key_skills, CHR(9), '')) +1), 2)
from public.vacancies
where  (name   ilike any ( '{search_ds_vac}')
or (name not like '%HTML%' and name like '%ML%')) 
'''

In [49]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\3654210517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [50]:
# текст запроса
query_6_6 = f'''
select
    experience,
    round(avg(COALESCE((salary_from+salary_to)/2, salary_to, salary_from)))
from public.vacancies
where  (name   ilike any ( '{search_ds_vac}')
or (name not like '%HTML%' and name like '%ML%')) 
and (salary_from is not null or salary_to is not null)
group by experience
'''

In [51]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\519194770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience     round
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

***

In [52]:
# выводы по предметному анализу
#В результате предметного анализа вакансий, относящихся к поиску специалистов по данным, можно сделать следующие выводы:
#В БД более 1750 вакансий, которые относятся к данным, что составляет примерно 3,5% от общего числа вакансий.
#Для соискателей на профессию дата-саентиста начального уровня доступно порядка 50 вакансий.
#В среденй работодатели указывают более 6 необходимых навыков для дата-саентиста.
#Что касается заработной платы, то соискатель без опыта может расчитыватьв в среднем на 75 тыс. рублей, 
#с опытом работы от 1 года до 3 лет на 140 тыс. руб., а с опытом работы от трех лет более чем на 200 тыс. руб.

# Общий вывод по проекту

In [53]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования
# Проанализировав данные можно сделать следующие выводы:
#В данной БД пости 50000 вакансий и 25000 работодателей не только из России и стран СНГ, а по всему миру.
#Но все же топ 5 городов по количеству вакансий: Москва, Санк-Петербург, Минск, Новосибирск, Алматы. 
#Где Москва более чем в два раза лидирует по количеству вакансий, у остальных же городов между собой не такой большой разрыв.
#Среднее значение нижней границы з/п около 71 тыс. руб, а верхней граница около 110 тыс. руб.
#Порядка 70% вакансий ищут людей на работу в офисе на полную занятость. Примерно 15% готовы предложить удаленную работу с полной занятостью.
#Из работодателей выбивается по показателям Яндекс, в котором открыто почти 2000 вакансий, что более чем в 4 раза больше следующих за ним Ростелеком, Тинькофф и Сбер.
#Яндекс, Ростелеком и Спецремонт осуществляют поиск специалистов в более чем 100 регионах. Яндекс ищет работников на удаленку, в то время как Ростелеком и Спецремонт
#ищут сотрудников из разных регионов, так как это компании, которые физически осуществляют обслуживание и строительство по всей стране.
#Разработкой программного обеспечения занимаются >15% работодателей. При этом примерно 30% работодателей не указали свою сферу деятельности.
#В топ-3 сфер деятельности входят исключительно ИТ-направления, что говорит об их актуальности.

In [54]:
#Дополнительный запрос на просмотр ТОП-20 компаний по количеству вакансий
query_5_add_1 = f'''
select e.name,
count(v.id)
from public.vacancies v
left join public.employers e on v.employer_id = e.id
group by 1
order by 2 desc
limit 20
'''

In [55]:
df = pd.read_sql_query(query_5_add_1, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\210586705.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_add_1, connection)

                        name  count
0                     Яндекс   1933
1                 Ростелеком    491
2                   Тинькофф    444
3                       СБЕР    428
4              Газпром нефть    331
5                ИК СИБИНТЕК    327
6                        МТС    292
7                    DataArt    247
8      Совкомбанк Технологии    204
9                 Первый Бит    176
10                      Ozon    175
11                       IBS    175
12                  Andersen    155
13                    Тензор    155
14                Спецремонт    151
15                        VK    150
16    Поляков Денис Иванович    127
17  Иннотех, Группа компаний    122
18           Bell Integrator    121
19                     ANCOR    118

In [56]:
#Дополнительный запрос на просмотр ТОП-20 регионов по количеству работодателей
query_5_add_2 = f'''
select a.name,
	count(distinct e.id) employers
from public.areas a 
	left join public.employers e on e.area = a.id
group by 1 
order by 2 desc
limit 20
'''

In [57]:
df = pd.read_sql_query(query_5_add_2, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\1245741367.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_add_2, connection)

               name  employers
0            Москва       5864
1   Санкт-Петербург       2217
2             Минск       1115
3            Алматы        721
4      Екатеринбург        609
5       Новосибирск        573
6            Казань        480
7   Нижний Новгород        426
8            Россия        410
9         Краснодар        409
10   Ростов-на-Дону        335
11       Красноярск        331
12          Ташкент        326
13           Самара        315
14       Нур-Султан        312
15        Челябинск        310
16          Воронеж        292
17              Уфа        252
18            Пермь        250
19           Тюмень        218

In [58]:
#Дополнительный запрос на просмотр ТОП-20 регионов по количеству работодателей, где нет вакансий
query_5_add_3 = f'''
select a.name,
	count(distinct e.id) employers
from public.areas a 
	left join public.employers e on e.area = a.id
    left join public.vacancies v on v.area_id=a.id
where v.id is null
group by 1 
order by 2 desc
limit 20
'''

In [59]:
df = pd.read_sql_query(query_5_add_3, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\639911267.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_add_3, connection)

                     name  employers
0                  Россия        410
1               Казахстан        207
2      Московская область         75
3      Краснодарский край         19
4      Ростовская область         18
5                Беларусь         18
6             Азербайджан         17
7   Нижегородская область         16
8    Республика Татарстан         16
9              Узбекистан         15
10   Белгородская область         10
11               Сингапур         10
12      Калужская область          9
13  Ленинградская область          9
14    Воронежская область          7
15      Самарская область          7
16      Кировская область          6
17             Кыргызстан          6
18              Австралия          6
19    Ставропольский край          6

In [60]:
#Дополнительный запрос на просмотр ТОП-10 сфер деятельности компаний
query_5_add_4 = f'''
select
i.name,
count(ei.employer_id)
from public.industries i
left join public.employers_industries ei on i.id=ei.industry_id
group by i.name
order by 2 desc
limit 10
'''

In [61]:
df = pd.read_sql_query(query_5_add_4, connection)
df

C:\Users\korol\AppData\Local\Temp\ipykernel_13220\1946986587.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_add_4, connection)

                                                name  count
0                Разработка программного обеспечения   3553
1  Системная интеграция,  автоматизации технологи...   2993
2  Интернет-компания (поисковики, платежные систе...   1675
3  Маркетинговые, рекламные, BTL, дизайнерские, E...    798
4                              Консалтинговые услуги    662
5                                 Кадровые агентства    389
6  Электронно-вычислительная, оптическая, контрол...    374
7                       Розничная сеть (продуктовая)    368
8                                   Интернет-магазин    351
9                        Архитектура, проектирование    346